#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dragon-ws/gh-action-local-k8s/runs/run-xUa4vtXY6b48Qxq3

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.http.workstation-external-ip: Refreshing...
data.http.workstation-external-ip: Refresh complete after 0s [id=http://ipv4.icanhazip.com]
aws_iam_policy.cloudwatch_logs_metrics_policy: Refreshing state... [id=arn:aws:iam::317884193661:policy/cloudwatch-logs-metrics-policy]
aws_iam_role.demo-cluster: Refreshing state... [id=terraform-eks-demo-cluster]
aws_ecr_repository.isolates-repo: Refreshing state... [id=isolates]
data.aws_availability_zones.available: Refreshing...
aws_iam_policy.eks_worknode_ebs_policy: Refreshing state... [id=arn:aws:iam::317884193661:policy/Amazon_EBS_CSI_Driver]
aws_vpc.demo: Refreshing state... [id=vpc-05127643231220a3a]
aws_iam_role.demo-node: Refreshing state... [id=terraform-eks-demo-node]
data.aws_availability_zones.available: Refresh complete after 0s [id=eu-west-1]
aws_iam_role_policy_attachment.demo-node-AmazonEKS_CNI_Policy: Refreshing state... [id=terraform-eks-demo-node-20230325102458486400000002]
aws_iam_role_policy_attachment.worknode-AmazonEBSCSIDriver: Refreshing state... [id=terraform-eks-demo-node-20230325102458490200000003]
aws_iam_role_policy_attachment.demo-cluster-AmazonEKSVPCResourceController: Refreshing state... [id=terraform-eks-demo-cluster-20230325102458467900000001]
aws_iam_role_policy_attachment.demo-node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=terraform-eks-demo-node-20230325102458692900000007]
aws_iam_role_policy_attachment.demo-cluster-AmazonEKSClusterPolicy: Refreshing state... [id=terraform-eks-demo-cluster-20230325102458522300000004]
aws_iam_role_policy_attachment.demo-node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=terraform-eks-demo-node-20230325102458536900000006]
aws_iam_role_policy_attachment.cloudwatch_logs_readonly_attachment: Refreshing state... [id=terraform-eks-demo-node-20230325102458525100000005]
aws_security_group.demo-cluster: Refreshing state... [id=sg-0e53740f3c487c080]
aws_internet_gateway.demo: Refreshing state... [id=igw-0be60999d7f50d327]
aws_subnet.demo[1]: Refreshing state... [id=subnet-0612627a60d6fc5af]
aws_subnet.demo[0]: Refreshing state... [id=subnet-0257853a288cfaceb]
aws_security_group_rule.demo-cluster-ingress-workstation-https: Refreshing state... [id=sgrule-4153367534]
aws_route_table.demo: Refreshing state... [id=rtb-038e728d67670a223]
aws_eks_cluster.demo: Refreshing state... [id=local-k8s]
aws_route_table_association.demo[0]: Refreshing state... [id=rtbassoc-0e21b7730a0397b77]
aws_route_table_association.demo[1]: Refreshing state... [id=rtbassoc-02af7666eca778623]
aws_eks_node_group.demo: Refreshing state... [id=local-k8s:demo]
aws_security_group.demo-cluster: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.addons["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "addons" {
      + addon_name        = "aws-ebs-csi-driver"
      + addon_version     = "v1.17.0-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "local-k8s"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # aws_security_group_rule.demo-cluster-ingress-workstation-https must be replaced
-/+ resource "aws_security_group_rule" "demo-cluster-ingress-workstation-https" {
      ~ cidr_blocks              = [ # forces replacement
          - "54.198.146.83/32",
          + "3.216.80.14/32",
        ]
      ~ id                       = "sgrule-4153367534" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @kofikodie, Action: `pull_request`*